<template>
  <div class="home">
    <div class="main-container">
      <div class="title-con">
        <h1>CANVAS</h1>
        <a target="_self" href="/index-bck.html">旧版</a>
      </div>
      <ul>
        <li v-for="(item, index) in pages" :key="index">
          <router-link :to="`/page/${item.path}`">{{ index + 1 }}. {{ item.title }}</router-link>
        </li>
<!--        <li><a href="./202003/中国国旗">1. 中国国旗</a></li>-->
<!--        <li><a href="./202003/象棋棋盘">2. 象棋棋盘</a></li>-->
<!--        <li><a href="./202003/硬笔练习纸">3. 硬笔练习纸</a></li>-->
<!--        <li><a href="./202003/旋转八卦图">4. 旋转八卦图</a></li>-->
<!--        <li><a href="./202003/无缝贴图(图片)">5. 无缝贴图(图片)</a></li>-->
<!--        <li><a href="./202003/无缝贴图(canvas)">6. 无缝贴图(canvas)</a></li>-->
<!--        <li><a href="./202003/随机显示小球">7. 随机显示小球</a></li>-->
<!--        <li><a href="./202003/乱撞的小球">8. 乱撞的小球</a></li>-->
<!--        <li><a href="./202003/彩色微粒">9. 彩色微粒</a></li>-->
<!--        <li><a href="./202003/散漫小球">10. 散漫小球</a></li>-->
<!--        <li><a href="./202003/随机射线">11. 随机射线</a></li>-->
<!--        <li><a href="./202003/字母变换">12. 字母变换</a></li>-->
<!--        <li><a href="./202003/随机迷宫线条">13. 随机迷宫线条</a></li>-->
<!--        <li><a href="./202003/星空背景">14. 星空背景</a></li>-->
<!--        <li><a href="./202003/无限扫描特效">15. 无限扫描特效</a></li>-->
<!--        <li><a href="./202003/激光特效">16. 激光特效</a></li>-->
<!--        <li><a href="./202003/∞符号动画">17. ∞符号动画</a></li>-->
<!--        <li><a href="./202003/旋转动画">18. 旋转动画</a></li>-->
<!--        <li><a href="./202004/几何颗粒动画">19. 几何颗粒动画</a></li>-->
<!--        <li><a href="./202004/排序动画/冒泡排序">20. 排序动画-冒泡排序</a></li>-->
<!--        <li><a href="./202004/排序动画/选择排序">21. 排序动画-选择排序</a></li>-->
<!--        <li><a href="./202004/排序动画/快速排序">22. 排序动画-快速排序</a></li>-->
<!--        <li><a href="./202004/新年倒计时雪花效果">23. 新年倒计时雪花效果</a></li>-->
<!--        <li><a href="./202004/下雨动画">24. 下雨动画</a></li>-->
<!--        <li><a href="./202004/时钟">25. 时钟</a></li>-->
<!--        <li><a href="./202004/旋转线条动画">26. 旋转线条动画</a></li>-->
<!--        <li><a href="./202004/彩色旋转线条">27. 彩色旋转线条</a></li>-->
<!--        <li><a href="./202004/彩色烟花动画">28. 彩色烟花动画</a></li>-->
<!--        <li><a href="./202004/心形动画">29. 心形动画</a></li>-->
<!--        <li><a href="./202004/心形环形动画">30. 心形环形动画</a></li>-->
<!--        <li><a href="./202004/正弦波">31. 正弦波</a></li>-->
<!--        <li><a href="./202004/旋转叠加效果">32. 旋转叠加效果</a></li>-->
<!--        <li><a href="./202004/傅立叶级数练习（一）">33. 傅立叶级数练习（一）</a></li>-->
<!--        <li><a href="./202004/分形图（一）">34. 分形图（一）</a></li>-->
<!--        <li><a href="./202005/分形图（二）">35. 分形图（二）</a></li>-->
<!--        <li><a href="./202005/分形图（三）">36. 分形图（三）</a></li>-->
<!--        <li><a href="./202005/分形图（四）">37. 分形图（四）</a></li>-->
<!--        <li><a href="./202005/分形图（五）">38. 分形图（五）</a></li>-->
<!--        <li><a href="202005/旋转构建动画（一）">39. 旋转构建动画（一）</a></li>-->
<!--        <li><a href="202005/旋转构建动画（二）">40. 旋转构建动画（二）</a></li>-->
<!--        <li><a href="202005/旋转构建动画（三）">41. 旋转构建动画（三）</a></li>-->
<!--        <li><a href="202005/分形图（六）">42. 分形图（六）</a></li>-->
<!--        <li><a href="202005/线条爱心动画">43. 线条爱心动画</a></li>-->
<!--        <li><a href="202005/旋转构建动画（四）">44. 旋转构建动画（四）</a></li>-->
<!--        <li><a href="202006/心形波函数动画">45. 心形波函数动画</a></li>-->
<!--        <li><a href="202006/旋转构建动画（五）">46. 旋转构建动画（五）</a></li>-->
<!--        <li><a href="202006/时间显示动画">47. 时间显示动画</a></li>-->
<!--        <li><a href="202006/万花尺">48. 万花尺</a></li>-->
<!--        <li><a href="202006/旋转构建动画（六）">49. 旋转构建动画（六）</a></li>-->
<!--        <li><a href="202006/视觉误差动画（一）">50. 视觉误差动画（一）</a></li>-->
<!--        <li><a href="202006/色彩">51. 色彩</a></li>-->
<!--        <li><a href="202006/视觉误差动画（二）">52. 视觉误差动画（二）</a></li>-->
<!--        <li><a href="202007/视觉误差动画（三）">53. 视觉误差动画（三）</a></li>-->
<!--        <li><a href="202007/鼠标点击效果">54. 鼠标点击效果</a></li>-->
<!--        <li><a href="202007/写一个字">55. 写一个字</a></li>-->
<!--        <li><a href="202007/静态图">56. 静态图</a></li>-->
<!--        <li><a href="202007/旋转构建动画（七）">57. 旋转构建动画（七）</a></li>-->
<!--        <li><a href="202007/旋转构建动画（八）">58. 旋转构建动画（八）</a></li>-->
<!--        <li><a href="202007/彩虹糖动画">59. 彩虹糖动画</a></li>-->
<!--        <li><a href="202008/动态螺旋线">60. 动态螺旋线</a></li>-->
<!--        <li><a href="202103/网速仪表盘">61. 网速仪表盘</a></li>-->
<!--        <li><a href="202104/圆内反射（一）">62. 圆内反射（一）</a></li>-->
<!--        <li><a href="202105/旋转构建动画（九）">63. 旋转构建动画（九）</a></li>-->
<!--        <li><a href="202105/圆内反射（二）">64. 圆内反射（二）</a></li>-->
<!--        <li><a href="202105/线绳">65. 线绳</a></li>-->
<!--        <li><a href="202106/视觉误差动画（四）">66. 视觉误差动画（四）</a></li>-->
<!--        <li><a href="202106/椭圆内反射">67. 椭圆内反射</a></li>-->
      </ul>
    </div>
    <v-footer />
  </div>
</template>

<script>
import vFooter from '@/components/layout/Footer.vue';
import pages from '@/router/page';

export default {
  name: 'home',
  components: {
    vFooter,
  },
  setup() {
    return {
      pages,
    };
  },
};
</script>
